# **İleri Birleştirme İşlemleri**

In [1]:
import pandas as pd

### birebir birleştirme

In [5]:
df1 = pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                    'grup':['Muhasebe','Muhendislik','Muhendis','İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse     Muhendis
3      Fatma           İK

In [6]:
df2 = pd.DataFrame({'calisanlar': ['Ayse','Ali','Veli','Fatma'],
                    'ilk_giris': [2010,1009,1014,1019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       1009
2       Veli       1014
3      Fatma       1019

In [7]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       1009
1       Veli  Muhendislik       1014
2       Ayse     Muhendis       2010
3      Fatma           İK       1019

In [8]:
pd.merge(df1,df2, on="calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       1009
1       Veli  Muhendislik       1014
2       Ayse     Muhendis       2010
3      Fatma           İK       1019

### çoktan teke

In [9]:
df3 = pd.merge(df1,df2)

In [10]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       1009
1       Veli  Muhendislik       1014
2       Ayse     Muhendis       2010
3      Fatma           İK       1019

In [13]:
df4 = pd.DataFrame({'grup': ['Muhasebe','Muhendislik','İK'],
                     'mudur':['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [14]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       1009    Caner
1       Veli  Muhendislik       1014  Mustafa
2      Fatma           İK       1019  Berkcan

### çoktan çoğa

In [18]:
df5 = pd.DataFrame({'grup':['Muhasebe','muhasebe','Muhendislik','Muhendislik','İK','İK'],
                    'yetenekler':['matematik','exel','kodlama','linux','excel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     muhasebe       exel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [19]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse     Muhendis
3      Fatma           İK

In [20]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1       Veli  Muhendislik    kodlama
2       Veli  Muhendislik      linux
3      Fatma           İK      excel
4      Fatma           İK    yonetim